In [22]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
from sklearn.preprocessing import StandardScaler

from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split

from sklearn.metrics import confusion_matrix,classification_report
from sklearn.metrics import accuracy_score
from sklearn.svm import SVC

# Titanic Dataset

In [2]:
titanic  = pd.read_csv(r'D:\Vinay\Digital Trainee\Python\Practice\DataSet\titanic.csv')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [24]:
titanic.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",0,27.000000,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",1,19.000000,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",1,29.699118,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",0,26.000000,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",0,32.000000,0,0,370376,7.75,NaN,Q

In [3]:
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [10]:
titanic['Sex']  = titanic['Sex'].map({'male' : 0,'female': 1 })

In [16]:
titanic['Age']=titanic['Age'].fillna(titanic['Age'].mean())

In [25]:
scaler = StandardScaler()
x = titanic.drop(['PassengerId','Name','Ticket', 'Cabin', 'Embarked'], axis = 1)
y = titanic['Survived']

In [26]:
x_transformed = scaler.fit_transform(x)

In [27]:
x_train,x_test,y_train,y_test = train_test_split(x_transformed,
                                                 y,
                                                 test_size =0.30, random_state = 8)

In [28]:
model = SVC()
model.fit(x_train, y_train)
y_train_pred = model.predict(x_train)
y_test_pred = model.predict(x_test)

D:\Software\Anaconda3\lib\site-packages\sklearn\svm\base.py:193: FutureWarning: The default value of gamma will change from 'auto' to 'scale' in version 0.22 to account better for unscaled features. Set gamma explicitly to 'auto' or 'scale' to avoid this warning.
  "avoid this warning.", FutureWarning)

In [29]:
print('Train Set Accuracy :' + str(accuracy_score(y_train_pred, y_train)*100))
print('Test Set Accuracy :' + str(accuracy_score(y_test_pred, y_test)*100))

Train Set Accuracy :100.0
Test Set Accuracy :100.0

# Iris Dataset

In [30]:
iris  = pd.read_csv(r'D:\Vinay\Digital Trainee\Python\Practice\DataSet\iris.csv')
iris.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [32]:
iris.tail()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [33]:
iris.isnull().sum()

Id               0
SepalLengthCm    0
SepalWidthCm     0
PetalLengthCm    0
PetalWidthCm     0
Species          0
dtype: int64

In [37]:
scaler = StandardScaler()
x1 = iris.drop(['Id','Species'], axis = 1)
y1 = iris['Species']

In [38]:
x1_transformed = scaler.fit_transform(x1)

In [39]:
x1_train,x1_test,y1_train,y1_test = train_test_split(x1_transformed,
                                                 y1,
                                                 test_size =0.30, random_state = 8)

In [40]:
model = SVC()
model.fit(x1_train, y1_train)
y1_train_pred = model.predict(x1_train)
y1_test_pred = model.predict(x1_test)

D:\Software\Anaconda3\lib\site-packages\sklearn\svm\base.py:193: FutureWarning: The default value of gamma will change from 'auto' to 'scale' in version 0.22 to account better for unscaled features. Set gamma explicitly to 'auto' or 'scale' to avoid this warning.
  "avoid this warning.", FutureWarning)

In [41]:
print('Train Set Accuracy :' + str(accuracy_score(y1_train_pred, y1_train)*100))
print('Test Set Accuracy :' + str(accuracy_score(y1_test_pred, y1_test)*100))

Train Set Accuracy :97.14285714285714
Test Set Accuracy :95.55555555555556

In [44]:
model.score(x1_train, y1_train)*100

97.14285714285714

In [45]:
model.score(x1_test, y1_test)*100

95.55555555555556